---
kind: property
id: P:Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylType
source: html/f9aa0eb4-2760-c357-6260-716d7c93d555.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylType Property

The property labeled "Type" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public static string PlasticvinylType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylType".